#include <stdio.h>

int main() {
    char name = 'P';
    int age = 18;
    float weight = 69.8;
    printf("Student %c is %d years old.\n", name, age);
    printf("His weighs is %.1f kg.\n", weight);
    return 0;
}
//1. #include <stdio.h> - รวมไลบรารีมาตรฐานสำหรับการรับ/แสดงผลข้อมูล
//2. int main() - ฟังก์ชันหลักที่โปรแกรมจะเริ่มทำงาน
//3. char name = 'P'; - ประกาศตัวแปรอักขระเก็บตัวแรกของชื่อเล่น
//4. int age = 18; - ประกาศตัวแปรจำนวนเต็มเก็บอายุ
//5. float weight = 69.8; - ประกาศตัวแปรทศนิยมเก็บน้ำหนัก
//6. printf()- แสดงผลบรรทัดแรก โดยใช้ %c สำหรับตัวอักษรและ %d สำหรับจำนวนเต็ม \n เพื่อเปลี่ยนบรรทัด
//7. printf()- แสดงผลบรรทัดสอง โดยใช้ %.1f สำหรับทศนิยม 1 ตำแหน่ง
//8. return 0; - ส่งค่ากลับเพื่อระบุว่าโปรแกรมทำงานสำเร็จ